Revit 2027 API
CurveLoopIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Curve Current { get; }
Public Overridable ReadOnly Property Current As Curve
	Get
public:
virtual property Curve^ Current {
	Curve^ get ();
}
abstract Current : Curve with get
override Current : Curve with get
Property Value
Curve
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
CurveLoopIterator Class
Autodesk.Revit.DB Namespace